backend/models/Admin_signup.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('test', 'test@admin.com', '$2y$13$WeKo/YKnkeWGRmnGiZhDEupwsT/.WQdyCyMV5DywaRemMbCttkr52', 'S7bnTGPPjbtgV9soM-iJGHGC4qfvaP1i', 10, 1465972206, 1465972206)
---
    public function signup(){
        if(!$this->validate()){
            return null;
        }
        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        return $user->save() ? $user : null;